In [3]:
import numpy as np
import pandas as pd

In [12]:
df = pd.read_csv('data/topyoutube.csv')
df

               Artist Total Views  100M     Avg
0                 BTS    27,947.9  63.0   7.370
1           Bad Bunny    27,573.4  66.0  14.555
2       Justin Bieber    27,399.7  37.0   3.986
3          Ed Sheeran    26,894.0  39.0   4.609
4        Taylor Swift    24,350.0  38.0   5.716
...               ...         ...   ...     ...
1582  Pietro Lombardi       204.1   NaN   0.022
1583            Duffy       203.2   NaN   0.020
1584          Psirico       201.1   1.0   0.039
1585       Alex Clare       200.8   NaN   0.020
1586       The Avener       200.5   NaN   0.036

[1587 rows x 4 columns]

In [22]:
#Tratamento dos dados

#Multiplicando a coluna de visualização por 100 milhôes
df['100M'] = df['100M'] * 100000000

#Substituindo nulos por "Não informado"
df_fillna = df.fillna('Não informado')

#Deixando a coluna AVG com apenas duas casas decimais
df_fillna['Avg'] = df_fillna['Avg'].round(2)


df_fillna

,Artist,Total Views,100M,Avg
0,BTS,"27,947.9",63000000000000007934302560770976391448494080.0,7.37
1,Bad Bunny,"27,573.4",65999999999999992749451712648623239928479744.0,14.56
2,Justin Bieber,"27,399.7",37000000000000000887058844535446249253371904.0,3.99
3,Ed Sheeran,"26,894.0",39000000000000000667345260070253014099689472.0,4.61
4,Taylor Swift,"24,350.0",38000000000000000777202052302849631676530688.0,5.72
...,...,...,...,...
1582,Pietro Lombardi,204.1,Não informado,0.02
1583,Duffy,203.2,Não informado,0.02
1584,Psirico,201.1,1000000000000000044885712678075916785549312.0,0.04
1585,Alex Clare,200.8,Não informado,0.02
1586,The Avener,200.5,Não informado,0.04

In [24]:
#Top 10
df_fillna.head(10)

,Artist,Total Views,100M,Avg
0,BTS,"27,947.9",63000000000000007934302560770976391448494080.0,7.37
1,Bad Bunny,"27,573.4",65999999999999992749451712648623239928479744.0,14.56
2,Justin Bieber,"27,399.7",37000000000000000887058844535446249253371904.0,3.99
3,Ed Sheeran,"26,894.0",39000000000000000667345260070253014099689472.0,4.61
4,Taylor Swift,"24,350.0",38000000000000000777202052302849631676530688.0,5.72
5,Shakira,"23,961.8",42999999999999995276157933998345444195827712.0,7.84
6,Katy Perry,"23,553.4",24999999999999997253580194185084560578969600.0,3.18
7,Ozuna,"22,524.8",48999999999999999568777337744286838331277312.0,4.93
8,Eminem,"20,937.7",38000000000000000777202052302849631676530688.0,5.84
9,Ariana Grande,"20,618.5",37000000000000000887058844535446249253371904.0,3.37

In [25]:
#Os primeiros 100 usuarios por nome decrescente
df_sorted = df.sort_values(by='Artist', ascending=False)

df_top_100 = df_sorted.head(100)

print(df_top_100)

             Artist Total Views          100M    Avg
1374         Łobuzy       396.5  2.000000e+42  0.113
537     İrem Derici     1,717.3  3.000000e+42  0.319
634      Ñengo Flow     1,388.8  4.000000e+42  0.825
1032  Çağatay Akman       742.7  2.000000e+42  0.049
350       will.i.am     2,582.0  6.000000e+42  0.295
...             ...         ...           ...    ...
516      Via Vallen     1,787.5  3.000000e+42  0.084
1507   Veysel Mutlu       277.4  1.000000e+42  0.029
1358         Veysel       412.2           NaN  0.058
891       Vengaboys       934.8  3.000000e+42  0.341
864       Vegedream       991.3  1.000000e+42  0.507

[100 rows x 4 columns]

In [61]:
df_ordenado = df_fillna.sort_values(by='Artist', ascending=False)

usuarios100 = df_ordenado.head(100)

print(usuarios100)

             Artist Total Views           100M   Avg
1374         Łobuzy       396.5            2.0  0.11
537     İrem Derici     1,717.3            3.0  0.32
634      Ñengo Flow     1,388.8            4.0  0.82
1032  Çağatay Akman       742.7            2.0  0.05
350       will.i.am     2,582.0            6.0  0.30
...             ...         ...            ...   ...
516      Via Vallen     1,787.5            3.0  0.08
1507   Veysel Mutlu       277.4            1.0  0.03
1358         Veysel       412.2  Não informado  0.06
891       Vengaboys       934.8            3.0  0.34
864       Vegedream       991.3            1.0  0.51

[100 rows x 4 columns]

In [25]:
df_fillna.isnull().sum()/df.shape[0] * 100

Artist         0.0
Total Views    0.0
100M           0.0
Avg            0.0
dtype: float64

In [4]:
#Valor em porcentagem de Nulos na base.
df.isnull().sum()/df.shape[0] * 100

Artist          0.000000
Total Views     0.000000
100M           10.775047
Avg             0.000000
dtype: float64

In [ ]:
#Grafico amostragem de Dados da base
df.hist(figsize=(10,10))

In [ ]:
#Resumo estatístico do dataframe
df.describe()

In [21]:
df[df.isnull().any(axis=1)]

               Artist Total Views  100M    Avg
495              Ceca     1,861.6   NaN  0.352
629    Carla's Dreams     1,400.8   NaN  0.361
738           Bushido     1,182.7   NaN  0.129
753      Mr. Children     1,164.3   NaN  0.553
772         Club Dogo     1,121.9   NaN  0.242
...               ...         ...   ...    ...
1581        Snakehips       205.9   NaN  0.020
1582  Pietro Lombardi       204.1   NaN  0.022
1583            Duffy       203.2   NaN  0.020
1585       Alex Clare       200.8   NaN  0.020
1586       The Avener       200.5   NaN  0.036

[171 rows x 4 columns]